---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalEquipment
source: html/2f50ad36-a392-67db-e317-3f225fb99d64.htm
---
# ElectricalEquipment Methods

Causes the object to release immediately any resources it may be utilizing.